Heat_Transfer/chtMultiRegionSimpleFoam/heatExchanger/constant/porous/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/porous/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

3
(
    inlet
    {
        type            patch;
        nFaces          900;
        startFace       104700;
    }
    outlet
    {
        type            patch;
        nFaces          900;
        startFace       105600;
    }
    fixedWalls
    {
        type            wall;
        inGroups        1(wall);
        nFaces          4800;
        startFace       106500;
    }
)

// ************************************************************************* //
